
/*************** (C) COPYRIGHT  EW工作室 ***************************************
 * 文件名  ：sysclock.c
 * 描述    ：系统时钟设置    
 * 实验平台：EW STM8入门板 V1.0
 * 库版本  ：V2.1.0
 * QQ群	   ：261825684
 * 修改时间：2013-08-20
*******************************************************************************/

/* 包含系统头文件 */

/* 包含自定义头文件 */
#include "sysclock.h"
#include "stm8s.h"
#include "stm8s_clk.h"
/* 自定义新类型 */

/* 自定义宏 */

/*******************************************************************************
 * 名称: Sysclock_Init
 * 功能: 设置系统时钟频率
 * 形参: 无
 * 返回: 无
 * 说明: 时钟选择

 ******************************************************************************/
void SystemClock_Init(void)
{
   CLK_DeInit();
   CLK_HSICmd(ENABLE);
   CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
   CLK_SYSCLKConfig(CLK_PRESCALER_CPUDIV1);

}


/******************* (C) COPYRIGHT EW工作室 *****END OF FILE******************/

